sub-routine/SY_3dHeatLoad/Automated/Sim_InnerField/Jet_inner_case_template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          235;
        startFace       807067;
    }
    outlet
    {
        type            patch;
        nFaces          1104;
        startFace       807302;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          36979;
        startFace       808406;
    }
)

// ************************************************************************* //
